Catalogs/бит_ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВарианта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВарианта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SettingsStorages/бит_ХранилищеВариантовОтчетов/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура содержит реализацию метода Загрузить(). 
//	В данном обработчике необходимо получить настройки из некоторого объекта. 
//	Например, из элемента справочника.
//
Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Наименование,
	|	бит_ВариантыОтчетов.ХранилищеВарианта
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта 	= &КлючОбъекта
	|	И бит_ВариантыОтчетов.КлючВарианта 	= &КлючВарианта 
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлючОбъекта" , КлючОбъекта);
	Запрос.УстановитьПараметр("КлючВарианта", КлючНастроек);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОписаниеНастроек.Представление 	= Выборка.Наименование;
		Настройки 						= Выборка.ХранилищеВарианта.Получить();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // ОбработкаЗагрузки()

// Процедура содержит реализацию метода Сохранить(). 
//	В данном обработчике необходимо выполнить сохранение настройки в некоторый объект. 
//	Например, в элемент справочника. 
//
Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройка, ОписаниеНастроек, Пользователь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта 	= &КлючОбъекта
	|	И бит_ВариантыОтчетов.КлючВарианта  = &КлючВарианта
	|";
		 
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлючОбъекта" , КлючОбъекта);
	Запрос.УстановитьПараметр("КлючВарианта", КлючНастроек);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Настройка.ДополнительныеСвойства.Вставить("КлючВарианта", КлючНастроек);  		
		
		НастройкаОбъект.ХранилищеВарианта = Новый ХранилищеЗначения(Настройка, Новый СжатиеДанных());
		Если ОписаниеНастроек <> Неопределено Тогда
			НастройкаОбъект.Наименование = ОписаниеНастроек.Представление;
		КонецЕсли;
		НастройкаОбъект.Записать();
		
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры // ОбработкаСохранения()

// Процедура – содержит реализацию метода ПолучитьОписание(). 
//	В данном обработчике необходимо заполнить описание настройки 
//  на основании свойств сохраненной настройки. 
//	Например, из элемента справочника.
//
Процедура ОбработкаПолученияОписания(КлючОбъекта, КлючНастроек, ОписаниеНастроек, Пользователь)
	
	ОписаниеНастроек.КлючОбъекта  = КлючОбъекта;
	ОписаниеНастроек.КлючНастроек = КлючНастроек;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка,
	|	бит_ВариантыОтчетов.Наименование
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта    = &КлючОбъекта
	|	И бит_ВариантыОтчетов.КлючВарианта = &КлючВарианта
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлючОбъекта" , КлючОбъекта);
	Запрос.УстановитьПараметр("КлючВарианта", КлючНастроек);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		НастройкаОтчета = Выборка.Ссылка;
		Если Не НастройкаОтчета.Пустая() Тогда
			ОписаниеНастроек.Представление = Выборка.Наименование;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПолученияОписания()

// Процедура содержит реализацию метода УстановитьОписание(). 
//	В данном обработчике необходимо заполнить описание сохраненной настройки 
//  из переданного объекта ОписаниеНастроек. 
//	Например, в элементе справочника.    
//
Процедура ОбработкаУстановкиОписания(КлючОбъекта, КлючНастроек, ОписаниеНастроек, Пользователь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	бит_ВариантыОтчетов.Ссылка
	|ИЗ
	|	Справочник.бит_ВариантыОтчетов КАК бит_ВариантыОтчетов
	|ГДЕ
	|	бит_ВариантыОтчетов.КлючОбъекта    = &КлючОбъекта
	|	И бит_ВариантыОтчетов.КлючВарианта = &КлючВарианта
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КлючОбъекта"  , КлючОбъекта);
	Запрос.УстановитьПараметр("КлючВарианта" , КлючНастроек);
		
	УстановитьПривилегированныйРежим(Истина);
	 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Ссылка = Выборка.Ссылка;
		Если Не Ссылка.Пустая() Тогда
			НастройкаОбъект = Ссылка.ПолучитьОбъект();
			НастройкаОбъект.Наименование = ОписаниеНастроек.Представление;
			НастройкаОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОбработкаУстановкиОписания()

#КонецЕсли

#КонецОбласти
